cavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 200;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           $internalField;
    }

    fixedWalls
    {
        type            fixedValue;
        value           uniform 250;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
